tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "awscli"
brew "bottom"
brew "conda-zsh-completion"
brew "systemd"
brew "curl"
brew "dog"
brew "duf"
brew "dust"
brew "fd"
brew "gcc"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "htop"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mcfly"
brew "ruby"
brew "mdless"
brew "mycli"
brew "neovim"
brew "node"
brew "noti"
brew "nvm"
brew "pandoc"
brew "podman-compose", link: false
brew "progress"
brew "pup"
brew "ranger"
brew "ripgrep"
brew "rustscan"
brew "sqlc"
brew "sshs"
brew "starship"
brew "tldr"
brew "tmux"
brew "todo-txt"
brew "trash-cli"
brew "tree"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zplug"
vscode "adpyke.vscode-sql-formatter"
vscode "amodio.tsl-problem-matcher"
vscode "crazyurus.miniprogram-vscode-extension"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "nespinozacr.mysql-autocomplete"
vscode "randomfractalsinc.vscode-data-table"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "tanhakabir.rest-book"
vscode "tomoki1207.pdf"
vscode "undefined_publisher.fw-lqs"
vscode "vscodevim.vim"
