tap "aws/tap"
tap "borkdude/brew"
tap "bufbuild/buf"
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "messense/macos-cross-toolchains"
tap "ms-jpq/sad"
tap "rbenv/tap"
tap "yoheimuta/protolint"
# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# Zstandard is a real-time compression algorithm
brew "zstd"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Download with resuming and segmented downloading
brew "aria2"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C parser in Python
brew "pycparser", link: false
# C Foreign Function Interface for Python
brew "cffi", link: false
# Cryptographic recipes and primitives for Python
brew "cryptography", link: false
# YAML Parser
brew "libyaml"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# GNU binary tools for native development
brew "binutils"
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Draw boxes around text
brew "boxes"
# New way of working with Protocol Buffers
brew "buf"
# Robust and modular log colorizer
brew "ccze"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Fix common misspellings in source code and text files
brew "codespell"
# Zsh completion for conda
brew "conda-zsh-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Securely send things from one computer to another
brew "croc"
# Reimplementation of ctags(1)
brew "ctags"
# Debugger for the Go programming language
brew "delve"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Platform built on V8 to build network applications
brew "node"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Program that can automate interactive applications
brew "expect"
# Perl script to extracts URLs from emails or plain text
brew "extract_url"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# MP3 player for Linux and UNIX
brew "mpg123"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Automatically generate Go test boilerplate from your source code
brew "gotests"
# Tool for vendoring Go dependencies
brew "govendor"
# Multimedia framework for research and academic purposes
brew "gpac"
# Library access to GnuPG
brew "gpgme"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line tool for generating regular expressions
brew "grex"
# Like cURL, but for gRPC
brew "grpcurl"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# HTTP client/server library for GNOME
brew "libsoup"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Development framework for multimedia applications
brew "gstreamer"
# VNC viewer widget for GTK
brew "gtk-vnc"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview4"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Command-line pager for JSON data
brew "jless"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Bitcoin command-line tool
brew "libbitcoin-explorer"
# Operating System information database
brew "libosinfo"
# C virtualization API
brew "libvirt"
# Libvirt API for glib-based programs
brew "libvirt-glib"
# Next-gen compiler infrastructure
brew "llvm"
# Count lines of code quickly
brew "loc"
# Scalable user load testing tool written in Python
brew "locust", link: false
# Run LogQL queries against a Loki server
brew "logcli"
# Rotates, compresses, and mails system logs
brew "logrotate", restart_service: true
# Horizontally-scalable, highly-available log aggregation system
brew "loki"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fly through your shell history
brew "mcfly"
# Scalable distributed version control system
brew "mercurial"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Mock code autogenerator for Golang
brew "mockery"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Text-mode videogame inspired by Namco's Pac-Man
brew "myman"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql@8.0"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Easy to use, powerful, and reliable system to process and distribute data
brew "nifi"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Libraries for security-enabled client and server applications
brew "nss"
# Modern shell for the GitHub era
brew "nushell"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk@17"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Linter for prose
brew "proselint"
# Show ps output as a tree
brew "pstree"
# Parse HTML at the command-line
brew "pup"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Cross-platform application and UI framework
brew "qt@5"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# Autoformat shell script source code
brew "shfmt"
# Export Slack data without admin privileges
brew "slackdump"
# Modern alternative network traffic sniffer
brew "sniffer"
# SOcket CAT: netcat on steroids
brew "socat"
# GTK client/libraries for SPICE
brew "spice-gtk"
# Terminal-based client for Spotify
brew "spotify-tui"
# Generate type safe Go from SQL
brew "sqlc"
# Opinionated Lua code formatter
brew "stylua"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# URL extractor/launcher
brew "urlview"
# Google's open source JavaScript engine
brew "v8@3.15", link: true
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# App for managing virtual machines
brew "virt-manager"
# Universal WebAssembly Runtime
brew "wasmer"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Translate common Internet acronyms
brew "wtf"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# C++ search engine library
brew "xapian"
# PDF viewer
brew "xpdf"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Plain text note-taking assistant
brew "zk"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# SSL/TLS cryptography library
brew "rbenv/tap/openssl@1.0"
# Pluggable tool to enforce Protocol Buffer style and conventions
brew "yoheimuta/protolint/protolint"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Column-oriented database management system
cask "clickhouse"
# Databases and SQL IDE
cask "datagrip"
# English dictionary
cask "eudic"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-consolas-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Font editor
cask "glyphs"
# Web browser
cask "google-chrome"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Personal data manager focusing on security
cask "keepassx"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Free and open-source media player
cask "kodi"
# Clipboard manager
cask "maccy"
# Minimal installer for conda
cask "miniconda"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Neovim Client
cask "neovide"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Snip or pin screenshots
cask "snipaste"
# Move and resize windows with ease
cask "spectacle"
# Video game digital distribution service
cask "steam"
# App to switch hosts
cask "switchhosts"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Free messaging and calling application
cask "wechat"
# Extended attribute editor
cask "xattred"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clarkyu.vscode-sql-beautify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "giscafer.leek-fund"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "guyutongxue.lalrpop-syntax-highlight"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mickael-menu.zk-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "nespinozacr.mysql-autocomplete"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.vscode-data-preview"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "sukumo28.wav-preview"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "xadillax.viml"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
