tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "autojump"
brew "bat"
brew "bottom"
brew "conda-zsh-completion"
brew "curl"
brew "dict"
brew "dog"
brew "duf"
brew "dust"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-delta"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "mcfly"
brew "neovim"
brew "node"
brew "noti"
brew "pandoc"
brew "podman", restart_service: true
brew "podman-compose"
brew "progress"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "todo-txt"
brew "trash-cli"
brew "tree"
brew "yarn"
brew "zplug"
vscode "amodio.tsl-problem-matcher"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "vscodevim.vim"
