autojump
bottom
conda-zsh-completion
dict
fd
fzf
gh
git-delta
htop
mcfly
neovim
node
noti
ranger
ripgrep
starship
tldr
todo-txt
tree
zplug
