tap "aws/tap"
tap "borkdude/brew"
tap "bufbuild/buf"
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "ms-jpq/sad"
tap "rbenv/tap"
tap "yoheimuta/protolint"
brew "ack"
brew "pkg-config"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "webp"
brew "aria2"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash"
brew "bat"
brew "binaryen"
brew "binutils"
brew "gcc"
brew "btop"
brew "ccze"
brew "choose-rust"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "codespell"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "delve"
brew "dog"
brew "duf"
brew "dust"
brew "erlang"
brew "node"
brew "eslint"
brew "extract_url"
brew "fd"
brew "libtool"
brew "gnutls"
brew "gobject-introspection"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fping"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitui"
brew "libksba"
brew "gpgme"
brew "gnu-sed"
brew "gotests"
brew "govendor"
brew "jasper"
brew "netpbm"
brew "graphviz"
brew "grex"
brew "grpcurl"
brew "hashcat"
brew "helm"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "ifstat"
brew "iftop"
brew "imagemagick"
brew "jfrog-cli"
brew "jless"
brew "jmeter"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libbitcoin-explorer"
brew "libxml2"
brew "libyaml"
brew "llvm"
brew "loc"
brew "locust", link: false
brew "logcli"
brew "logrotate", restart_service: true
brew "lsd"
brew "lua"
brew "lynx"
brew "make"
brew "markdownlint-cli"
brew "mcfly"
brew "mercurial"
brew "mkcert"
brew "mockery"
brew "mpg123"
brew "mycli"
brew "mysql@5.7", link: true
brew "neofetch"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nushell"
brew "pandoc"
brew "pgformatter"
brew "qemu"
brew "podman"
brew "prettier"
brew "procs"
brew "proselint"
brew "pstree"
brew "python@3.8"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "shfmt"
brew "sniffer"
brew "socat"
brew "spotify-tui"
brew "stylua"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "todo-txt"
brew "trash-cli"
brew "tree"
brew "unar"
brew "urlview"
brew "v8@3.15", link: true
brew "vte3"
brew "virt-manager"
brew "watch"
brew "wget"
brew "wrk"
brew "wtf"
brew "xapian"
brew "xpdf"
brew "xplr"
brew "yarn"
brew "zellij"
brew "zk"
brew "zlib"
brew "zoxide"
brew "zplug"
brew "bufbuild/buf/buf"
brew "ms-jpq/sad/sad"
brew "rbenv/tap/openssl@1.0"
brew "yoheimuta/protolint/protolint"
cask "adoptopenjdk"
cask "alacritty"
cask "alt-tab"
cask "another-redis-desktop-manager"
cask "audacity"
cask "beekeeper-studio"
cask "bloomrpc"
cask "clash-for-windows"
cask "datagrip"
cask "dbeaver-community"
cask "docker"
cask "eudic"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-consolas-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "fontforge"
cask "gimp"
cask "glyphs"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "listen1"
cask "logseq"
cask "maccy"
cask "mark-text"
cask "miniconda"
cask "monitorcontrol"
cask "neovide"
cask "neteasemusic"
cask "ngrok"
cask "obs"
cask "postman"
cask "snipaste"
cask "sourcetrail"
cask "steam"
cask "stretchly"
cask "switchhosts"
cask "tableplus"
cask "uu-booster"
cask "visual-studio-code"
cask "vlc"
cask "wechat"
cask "zerotier-one"
cask "zoom"
