{
<<<<<<< HEAD
  "LuaSnip": { "branch": "master" },
  "NvChad": { "branch": "v2.5" },
||||||| parent of fb491b1 (add)
  "LuaSnip": { "branch": "master" },
  "NvChad": { "branch": "v2.5" },
=======
  "LuaSnip": { "branch": "master" },
  "NvChad": { "branch": "v2.5" },
>>>>>>> fb491b1 (add)
  "avante.nvim": { "branch": "main" },
<<<<<<< HEAD
  "base46": { "branch": "v3.0" },
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "base46": { "branch": "v3.0" },
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
=======
  "base46": { "branch": "v3.0" },
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "bufferize.vim": { "branch": "main" },
<<<<<<< HEAD
  "codecompanion-history.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "codecompanion-history.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
=======
  "codecompanion-history.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "crates.nvim": { "branch": "main" },
  "diffview.nvim": { "branch": "main" },
  "dropbar.nvim": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
<<<<<<< HEAD
  "fidget.nvim": { "branch": "main" },
  "flit.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "fidget.nvim": { "branch": "main" },
  "flit.nvim": { "branch": "main" },
=======
  "fidget.nvim": { "branch": "main" },
  "flit.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "friendly-snippets": { "branch": "main" },
  "fzf-lua": { "branch": "main" },
  "git-blame.nvim": { "branch": "master" },
  "git-conflict.nvim": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
<<<<<<< HEAD
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
=======
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "glow.nvim": { "branch": "main" },
<<<<<<< HEAD
  "go.nvim": { "branch": "master" },
  "grug-far.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "go.nvim": { "branch": "master" },
  "goose.nvim": { "branch": "main" },
  "grug-far.nvim": { "branch": "main" },
=======
  "go.nvim": { "branch": "master" },
  "goose.nvim": { "branch": "main" },
  "grug-far.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "guihua.lua": { "branch": "master" },
<<<<<<< HEAD
  "hardtime.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "hardtime.nvim": { "branch": "main" },
=======
  "hardtime.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "incline.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
<<<<<<< HEAD
  "leap.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "leap.nvim": { "branch": "main" },
=======
  "leap.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "live-command.nvim": { "branch": "main" },
  "marks.nvim": { "branch": "master" },
<<<<<<< HEAD
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
=======
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "menu": { "branch": "main" },
<<<<<<< HEAD
  "mini.diff": { "branch": "main" },
  "mini.pick": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "mini.diff": { "branch": "main" },
=======
  "mini.diff": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "minty": { "branch": "main" },
  "neogen": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-go": { "branch": "main" },
  "neotest-plenary": { "branch": "master" },
  "neotest-vim-test": { "branch": "master" },
<<<<<<< HEAD
  "none-ls.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "none-ls.nvim": { "branch": "main" },
=======
  "none-ls.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "nui.nvim": { "branch": "main" },
<<<<<<< HEAD
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
=======
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-ui": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "nvim-dap-virtual-text": { "branch": "master" },
<<<<<<< HEAD
  "nvim-lspconfig": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "nvim-lspconfig": { "branch": "master" },
=======
  "nvim-lspconfig": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "nvim-navic": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
<<<<<<< HEAD
  "nvim-notify": { "branch": "master" },
  "nvim-origami": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "nvim-notify": { "branch": "master" },
  "nvim-origami": { "branch": "main" },
=======
  "nvim-notify": { "branch": "master" },
  "nvim-origami": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "nvim-scrollbar": { "branch": "main" },
<<<<<<< HEAD
  "nvim-surround": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "nvim-surround": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
=======
  "nvim-surround": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
<<<<<<< HEAD
  "nvim-web-devicons": { "branch": "master" },
  "nvim_context_vt": { "branch": "master" },
||||||| parent of fb491b1 (add)
  "nvim-web-devicons": { "branch": "master" },
  "nvim_context_vt": { "branch": "master" },
=======
  "nvim-web-devicons": { "branch": "master" },
  "nvim_context_vt": { "branch": "master" },
>>>>>>> fb491b1 (add)
  "persisted.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "rainbow_csv": { "branch": "master" },
<<<<<<< HEAD
  "refactoring.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "refactoring.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
=======
  "refactoring.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "rustaceanvim": { "branch": "master" },
<<<<<<< HEAD
  "schemastore.nvim": { "branch": "main" },
||||||| parent of fb491b1 (add)
  "schemastore.nvim": { "branch": "main" },
=======
  "schemastore.nvim": { "branch": "main" },
>>>>>>> fb491b1 (add)
  "snacks.nvim": { "branch": "main" },
  "symbol-usage.nvim": { "branch": "main" },
  "symbols-outline.nvim": { "branch": "master" },
  "tabular": { "branch": "master" },
  "targets.vim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-zoxide": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "ui": { "branch": "v3.0" },
  "unimpaired.nvim": { "branch": "main" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-just": { "branch": "main" },
  "vim-markdown": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "volt": { "branch": "main" },
  "which-key.nvim": { "branch": "main" },
  "yanky.nvim": { "branch": "main" },
  "zk-nvim": { "branch": "main" }
}
